-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-10-28 04:15:32
-- 服务器版本： 10.1.16-MariaDB
-- PHP Version: 5.6.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fantasystar`
--

-- --------------------------------------------------------

--
-- 表的结构 `book`
--

CREATE TABLE `book` (
  `FSBN` mediumint(5) NOT NULL,
  `FSBOOK` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `ISBN` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `AUTHOR` varchar(80) COLLATE utf8_unicode_ci NOT NULL,
  `BNUM` tinyint(4) NOT NULL,
  `PRICE` float(7,2) NOT NULL,
  `PUB` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `BDATE` date NOT NULL,
  `ISBOR` tinyint(4) NOT NULL,
  `BORNUM` int(4) NOT NULL DEFAULT '0',
  `BSCORE` decimal(2,1) NOT NULL,
  `STORAGE` varchar(15) COLLATE utf8_unicode_ci NOT NULL,
  `INFO` text COLLATE utf8_unicode_ci NOT NULL,
  `NOTE` tinytext COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `book`
--

INSERT INTO `book` (`FSBN`, `FSBOOK`, `ISBN`, `AUTHOR`, `BNUM`, `PRICE`, `PUB`, `BDATE`, `ISBOR`, `BORNUM`, `BSCORE`, `STORAGE`, `INFO`, `NOTE`) VALUES
(10001, '软件体的生命周期', '978-7-5447-5246-6', '特德·姜', 1, 35.00, '译林出版社', '2015-05-01', 0, 1, '0.0', '沈曦', '《软件体的生命周期》是[美国]特德·姜的作品，2015年5月译林出版社出版。译者张博然等。\r\n作者特德·姜是为世界科幻界认可的华裔科幻作家。他游走在科幻边缘，在科幻架构上探讨哲学、人性与情感。《软件体的生命周期》一书结集了特德·姜的《软件体的生命周期》、《赏心悦目》、《商人和炼金术士之门》等六部作品。随着数码体市场的发展、壮大、冷淡和萧条，数码体们的命运也随之发生变迁。', '第八届上海高校幻想节（海事场）奖品'),
(10002, '  银河帝国Ⅰ\n   基地', ' 978-7-5399-4979-6', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 29.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.2', ' 沈曦', '', ' 社团财产'),
(10003, '  银河帝国Ⅱ\n   基地与帝国', ' 978-7-5399-4978-9', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 29.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.4', ' 沈曦', '', ' 社团财产'),
(10004, '  银河帝国Ⅲ\n   第二帝国', ' 978-7-5399-5268-0', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译\n', 1, 29.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.6', ' 沈曦', '', ' 社团财产'),
(10005, '  银河帝国Ⅳ\n   基地前奏', ' 978-7-5399-5434-9', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 39.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.4', ' 沈曦', '', ' 社团财产'),
(10006, '  银河帝国Ⅴ\n   迈向基地', ' 978-7-5399-5435-6', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 39.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.6', ' 沈曦', '', ' 社团财产'),
(10007, '  银河帝国Ⅵ\n   基地边缘', ' 978-7-5399-5436-3', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 39.90, '江苏文艺出版社', '2015-01-01', 1, 0, '9.6', ' 沈曦', '', ' 社团财产'),
(10008, '  银河帝国Ⅶ\n   基地与地球', ' 978-7-5399-5437-0', '〔美〕艾萨克·阿西莫夫著 \n       叶李华译', 1, 46.00, '江苏文艺出版社', '2015-01-01', 1, 0, '9.2', ' 沈曦', '', ' 社团财产'),
(10009, '  伤心者', ' 978-7-5399-8643-2', '         何夕著', 1, 35.00, '江苏凤凰文艺出版社', '2015-10-01', 1, 0, '9.0', ' 沈曦', '', ' 社团财产'),
(10010, '  六道众生', ' 978-7-5354-5865-0', '         何夕著', 3, 32.00, '长江文艺出版社', '2012-09-01', 3, 0, '0.0', ' 沈曦', '', ' 社团财产'),
(10011, '  湿婆之舞', ' 978-7-5364-7481-9', '         江波著', 1, 38.00, '四川出版集团·四川科学技术出版社', '2012-10-01', 1, 0, '0.0', ' 沈曦', '', '有作者亲笔签名（林绍鹏捐赠）'),
(10012, '  银河之心\n ·暗黑深渊', ' 978-7-5364-09-4', '         江波著', 1, 34.00, '四川出版集团·四川科学技术出版社', '2013-08-01', 1, 0, '0.0', ' 沈曦', '', '有作者亲笔签名（林绍鹏捐赠）'),
(10013, '  差分机', ' 978-7-5133-1181-6', '  威廉·吉布森 布鲁斯·斯\n  特林著     雒城译', 1, 45.00, '新星出版社', '2014-11-01', 1, 0, '0.0', ' 沈曦', '', '杨一苇捐赠'),
(10014, '与机器人同行', ' 987-7-5364-8215-9', '         阿缺著', 1, 32.00, '四川出版集团·四川科学技术出版社', '2015-10-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10015, '  湮灭\n  遗落的南境', ' 978-7-5455-1616-6', '〔美〕杰夫·范德米尔著 \n        胡绍晏译', 1, 28.00, '天地出版社', '2016-02-01', 1, 0, '7.8', ' 沈曦', '', '社团财产'),
(10016, '  医院', ' 978-7321-6044-0', '        韩松著', 1, 35.00, '上海文艺出版社', '2016-05-01', 1, 0, '0.0', ' 沈曦', '', '有作者亲笔签名（杨昊霖捐赠）'),
(10017, '三体X观想之宙', ' 978-7-229-03981-3', '        宝树著', 1, 17.00, '重庆出版社', '2011-06-01', 1, 0, '0.0', ' 沈曦', '', '有作者亲笔签名'),
(10018, '  时间之墟', ' 978-7-5354-6887-1', '        宝树著', 1, 29.80, '长江文艺出版社', '0000-00-00', 1, 0, '8.0', ' 沈曦', '', ' 社团财产'),
(10019, '  与吾同在', ' 978-7-229-04528-9', '       王晋康著', 1, 29.00, '重庆出版社', '2011-09-01', 1, 0, '0.0', ' 沈曦', '', '有作者亲笔签名（林绍鹏捐赠）'),
(10020, ' 2037化学笔记', ' 978-7-5354-6161-2', '       陈奕璐著', 1, 26.80, '长江文艺出版社', '0000-00-00', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10021, '  星云Ⅳ', ' 7-5364-6050-3', '  陈楸帆 飞氘 七月', 1, 15.00, '四川出版集团·四川科学技术出版社', '2006-09-01', 1, 0, '8.2', ' 沈曦', '', '社团财产'),
(10022, '  星云Ⅴ', ' 7-5364-6099-6', '       吴弼川著', 1, 15.00, '四川出版集团·四川科学技术出版社', '2006-11-01', 1, 0, '8.2', ' 沈曦', '', '社团财产'),
(10023, '  本日优惠日', ' 978-7-5329-4208-4', '      朱川凑人著\n       丁丁虫译', 1, 25.00, '山东文艺出版社', '2013-08-01', 1, 0, '0.0', ' 沈曦', '', '杨一苇捐赠'),
(10024, '银河系搭车客   \n   指南', ' 978-7-5327-5468-7', '〔英〕道格拉斯·亚当斯著\n       姚向辉译', 1, 26.00, '上海译文出版社', '2014-11-01', 1, 0, '8.6', ' 沈曦', '', '社团财产'),
(10025, '  基本上无害', ' 978-7-5364-6603-6', '〔英〕道格拉斯·亚当斯著\n        胡纾译', 1, 20.00, '四川出版集团·四川科学技术出版社', '2008-12-01', 1, 0, '8.4', ' 沈曦', '', '社团财产'),
(10026, '  拜拜，\n多谢你们的鱼', ' 978-7-5364-6602-9', '〔英〕道格拉斯·亚当斯著\n        胡纾译', 1, 16.00, '四川出版集团·四川科学技术出版社', '2008-12-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10027, '  生命丶\n宇宙的一切', ' 978-7-5364-6597-8', '〔英〕道格拉斯·亚当斯著\n        胡纾译', 1, 18.00, '四川出版集团·四川科学技术出版社', '2008-12-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10028, '  科幻 \n原力觉醒', ' 978-7-5306-6937-2', '       郑军/主编', 2, 20.00, '百花文艺出版', '0000-00-00', 2, 0, '0.0', ' 沈曦', '', '社团财产'),
(10029, '  蚁人·\n  重生之人', ' 978-7-302-43144-2', '〔美〕尼克·斯宾塞/著\n〔西班牙〕拉蒙·罗赞拉斯 等/绘\n      克瑞斯/译', 1, 45.00, '清华大学出版社', '0000-00-00', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10030, '  蚁人·\n  电影前奏', ' 978-7-302-42039-2', '     威尔·科罗纳·皮尔格林/著\n〔墨〕米格尔·赛普尔韦达 等/绘\n       克瑞斯/译', 1, 55.00, '清华大学出版社', '0000-00-00', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10031, '  科幻世界', ' 1003-7055', '     王晋康  郝景芳', 1, 5.00, '成都市邮政局', '2008-08-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10032, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2008-02-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10033, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2008-05-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10034, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2009-01-01', 2, 0, '0.0', ' 沈曦', '', '社团财产'),
(10035, '  科幻世界', ' 1003-7055', '     ', 1, 5.00, '成都市邮政局', '2009-03-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10036, '  科幻世界', ' 1003-7055', '   ', 1, 5.00, '成都市邮政局', '2009-06-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10037, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2009-08-01', 1, 0, '7.4', ' 沈曦', '', '社团财产'),
(10038, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2009-10-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10039, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2010-03-01', 2, 0, '7.0', ' 沈曦', '', '社团财产'),
(10040, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2010-04-01', 1, 0, '7.0', ' 沈曦', '', '社团财产'),
(10041, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2010-08-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10042, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2010-09-01', 1, 0, '6.6', ' 沈曦', '', '社团财产'),
(10043, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2011-09-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10044, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2011-10-01', 1, 0, '0.0', ' 沈曦', '', '社团财产'),
(10045, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2012-02-01', 1, 0, '7.0', ' 沈曦', '', '社团财产'),
(10046, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2012-05-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10047, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2012-09-01', 2, 0, '7.2', ' 沈曦', '', '社团财产'),
(10048, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2013-01-01', 2, 0, '7.6', ' 沈曦', '', '社团财产'),
(10049, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2013-12-01', 1, 0, '7.0', ' 沈曦', '', '社团财产'),
(10050, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-03-01', 1, 0, '7.4', ' 沈曦', '', '社团财产'),
(10051, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-04-01', 1, 0, '7.6', ' 沈曦', '', '社团财产'),
(10052, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-05-01', 1, 0, '7.6', ' 沈曦', '', '社团财产'),
(10053, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-06-01', 1, 0, '7.2', ' 沈曦', '', '社团财产'),
(10054, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-07-01', 1, 0, '7.4', ' 沈曦', '', '社团财产'),
(10055, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-08-01', 1, 0, '7.4', ' 沈曦', '', '社团财产'),
(10056, '  科幻世界\n  (译文版)', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-09-01', 1, 0, '7.6', ' 沈曦', '', '社团财产'),
(10057, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2014-09-01', 2, 0, '7.6', ' 沈曦', '', '社团财产'),
(10058, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-10-01', 1, 0, '7.6', ' 沈曦', '', '社团财产'),
(10059, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2014-11-01', 1, 0, '7.0', ' 沈曦', '', '社团财产'),
(10060, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2014-12-01', 2, 0, '7.2', ' 沈曦', '', '社团财产'),
(10061, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2015-01-01', 2, 0, '6.8', ' 沈曦', '', '杨一苇捐赠'),
(10062, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2015-02-01', 2, 0, '7.8', ' 沈曦', '', '杨一苇捐赠'),
(10063, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2015-03-01', 2, 0, '7.4', ' 沈曦', '', '杨一苇捐赠'),
(10064, '  科幻世界', ' 1003-7055', '', 2, 5.00, '成都市邮政局', '2015-04-01', 2, 0, '7.2', ' 沈曦', '', '杨一苇捐赠'),
(10065, '  科幻世界', ' 1003-7055', '', 1, 5.00, '成都市邮政局', '2015-05-01', 1, 0, '7.6', ' 沈曦', '', '杨一苇捐赠');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`FSBN`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `book`
--
ALTER TABLE `book`
  MODIFY `FSBN` mediumint(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10066;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
